데이터에 대한 접근 FM  
1개: at/iat --> 하나로 가로, 세로를 다 몰아야함
2개 이상: loc, iloc --> 경우에 따라서 숫자가 편할 때가 있고,  
                        내가 만든 것이 편할 때 있어서 모두 다 핸들링 할 수 있어야함

+++ 데이터 처리  
줄 단위로 간단히 처리: lambda apply를 이용해서 내가 원하는 기능을 줄 단위로 적용  
--> 내가 처리할 / 필요한 영역이 어디인지 파악  
--> 전체인지, 일부인지!

+++ for 전체 데이터를 돌아가면서 진행을 하는 경우

In [2]:
### 여러 개의 파일 일괄 처리

In [1]:
import pandas as pd
import numpy as np

In [ ]:
data1 = pd.read_csv("‪C:/Users/NTX550/Documents/GitHub/T_ACADEMY_ASAC/Numpy/data/06_manyfile/1763.csv")
data2 = pd.read_csv("~~~data2.csv")
...
data100 = pd.read_csv("~~~data100..csv")
# ctrl + C / V : 반복되는 부분
# pd.read_csv 동일
# 바뀌는 친구들은 : 내가 불러야할 파일경로+이름, 변수명도 제

In [3]:
import os
import sys
import glob

In [10]:
# 내가 원하는 파일명을 리스트로 받아 처리하겠다
# *.csv로 끝나는 파일을 찾는다
many_file_path = "data/06_manyfile/*.csv"
file_path = glob.glob(many_file_path)
file_path

['data/06_manyfile\\1763.csv',
 'data/06_manyfile\\1764.csv',
 'data/06_manyfile\\1765.csv',
 'data/06_manyfile\\1766.csv',
 'data/06_manyfile\\1767.csv',
 'data/06_manyfile\\1768.csv',
 'data/06_manyfile\\1769.csv',
 'data/06_manyfile\\1770.csv',
 'data/06_manyfile\\1771.csv',
 'data/06_manyfile\\1772.csv']

In [11]:
temp = pd.read_csv(file_path_list[3])
temp.head()

   ITE00100554  17660101  TMAX  -26  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0  ITE00100554  17660101  TMIN  -50         NaN        NaN  E         NaN
1  ITE00100554  17660102  TMAX   -9         NaN        NaN  E         NaN
2  ITE00100554  17660102  TMIN  -29         NaN        NaN  E         NaN
3  ITE00100554  17660103  TMAX    1         NaN        NaN  E         NaN
4  ITE00100554  17660103  TMIN  -13         NaN        NaN  E         NaN

In [13]:
# vars함수 문자열을 변수명으로 처리한다
vars()['temp']

     ITE00100554  17660101  TMAX  -26  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0    ITE00100554  17660101  TMIN  -50         NaN        NaN  E         NaN
1    ITE00100554  17660102  TMAX   -9         NaN        NaN  E         NaN
2    ITE00100554  17660102  TMIN  -29         NaN        NaN  E         NaN
3    ITE00100554  17660103  TMAX    1         NaN        NaN  E         NaN
4    ITE00100554  17660103  TMIN  -13         NaN        NaN  E         NaN
..           ...       ...   ...  ...         ...        ... ..         ...
724  ITE00100554  17661229  TMIN    9         NaN        NaN  E         NaN
725  ITE00100554  17661230  TMAX   28         NaN        NaN  E         NaN
726  ITE00100554  17661230  TMIN   -2         NaN        NaN  E         NaN
727  ITE00100554  17661231  TMAX   29         NaN        NaN  E         NaN
728  ITE00100554  17661231  TMIN   -1         NaN        NaN  E         NaN

[729 rows x 8 columns]

In [14]:
# 내가 관심있는 파일명과 확장자만 반환해준다.
os.path.basename("C:/Users/NTX550/Documents/GitHub/T_ACADEMY_ASAC/Numpy/data/06_manyfile/1763.csv")

'1763.csv'

In [ ]:
data_1769 = pd.read_csv("~~~/1769.csv")
data_1780 = pd.read_csv("~~~/1769.csv")

In [17]:
for f in file_path:
    # 개별 파일마다 read_csv를 수행하는데...
    # 변수명을 문자열을 통해서 자동...: vars()
    temp = os.path.basename(f).split(".")[0]
    vars()["data_"+str(temp)] = pd.read_csv(f)      # 파일명을 다 다르게 해서 저장ㅜㅜ 코드 너무 이쁘다
print("Done!")

Done!

In [18]:
# 변수명에 잘 들어갔는지 확인
data_1769

     ITE00100554  17690101  TMAX  49  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0    ITE00100554  17690101  TMIN  29         NaN        NaN  E         NaN
1    ITE00100554  17690102  TMAX  47         NaN        NaN  E         NaN
2    ITE00100554  17690102  TMIN  33         NaN        NaN  E         NaN
3    ITE00100554  17690103  TMAX  38         NaN        NaN  E         NaN
4    ITE00100554  17690103  TMIN  14         NaN        NaN  E         NaN
..           ...       ...   ...  ..         ...        ... ..         ...
724  ITE00100554  17691229  TMIN  19         NaN        NaN  E         NaN
725  ITE00100554  17691230  TMAX  26         NaN        NaN  E         NaN
726  ITE00100554  17691230  TMIN   2         NaN        NaN  E         NaN
727  ITE00100554  17691231  TMAX   6         NaN        NaN  E         NaN
728  ITE00100554  17691231  TMIN -24         NaN        NaN  E         NaN

[729 rows x 8 columns]

In [19]:
# EXCEL : sheet 중심!! 1개 엑셀 파일에 여러개의 시트
# --> 열 때 어떤 시트를 열까요

In [20]:
path = "C:/Users/NTX550/Documents/GitHub/T_ACADEMY_ASAC/Numpy/data/11_sales-funnel.xlsx"
data_excel = pd.read_excel(path, sheet_name="Sheet1")
data_excel.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [ ]:
# 계속 버전업을 하면서
# 엑셀의 구버전 xls는 되고, xlsx는 다른 xlsxwriter!!
# 최근에는 구/신 모두 그냥 to_excel
data_excel.to_excel("~~~/name.xlsx")

In [27]:
# 입력 : read_~~~
# 출력 : 어떤 DF.to_~~~


# 불러들이는 경우
# case1) 파일 형태: read__~, to_~
# case2) 데이터 주고 web

In [25]:
# JSON : 데이터를 주고 받는 용도로
# ------> csv : 값하고, 그것들을 구별하는 구분자..
# ------> json : 어떤 것은 뭐구요, 여러개가 있을 때는 뭐뭐뭐~~~
#                파이썬의 리스트, dict와 모양이 유사
#         파이썬을 이용하는 관점에서는 파이썬의 리스트, dict 바뀌..
#         정수인덱스, 키값 등을 이용해서 편히 핸들링

In [26]:
import json

In [28]:
# json 데이터 샘플

In [29]:
json_data1 = """{
    "color" : "red",
    "value" : "$100"
}
"""
json_data1

'{\n    "color" : "red",\n    "value" : "$100"\n}\n'